/*
alert(  ("" + 1 + 0)); // слева - направо, строка + 1 = "1" , потом "1" + "0" - "10", строка
alert(  ("" - 1 + 0));  // минус не умеет со строками, будет просто -1, число (пустая строка приведена будет к 0, в итоге 0-1+0)
alert( true + false); // унарный оператор приведет к числам, будет 1+0 = 1, число
alert(6 / "3"); //2, число, со строками тока + работает
alert("2" * "3"); // 6, число, со строками тока + работает
alert(4 + 5 + "px"); // тут слева направо, будет 4+5=9, и плюс строка, получаем "9px"
alert("$" + 4 + 5); // слева направо, будет $+4 = "$4" , строка, и плюс 5, будет "$45"
alert ("4" - 2); // тока плюс умеет со строками, будет число 2
alert("4px" - 2); // тока плюс умеет со строками, будет NaN (px не удастся распарсить) - 2, будет NaN, число
alert("  -9  " + 5); // тут плюс, работаем слева направо со строкой, будет строка "  -9  5"
alert("  -9  " - 5); //тут минус, не работает со строками, будет -9-5 = -14, число
alert(null + 1); // тут null в 0 преобразуем, будет 0+1 = 1, число
alert(undefined + 1); // тут будет преобразование undefined в NaN, и потом +1, будет NaN, число
alert(" \t \n" - 2); // минус не умеет со строкой, будет пустая строка (тк табуляция и пробелы убираются), значит преобразование в 0 и 0-2 = -2, число

тут проверил, 2 ошибки по невнимательности!! а так все четко, надо запомнить что NaN от undefined получаем при числовом приведении
*/

alert( typeof ("" + 1 + 0)); // слева - направо, строка + 1 = "1" , потом "1" + "0" - "10", строка
alert( typeof ("" - 1 + 0));  // минус не умеет со строками, будет просто -1, число (пустая строка приведена будет к 0, в итоге 0-1+0)
alert(typeof( true + false)); // унарный оператор приведет к числам, будет 1+0 = 1, число
alert(typeof(6 / "3")); //2, число, со строками тока + работает
alert(typeof("2" * "3")); // 6, число, со строками тока + работает
alert(typeof(4 + 5 + "px")); // тут слева направо, будет 4+5=9, и плюс строка, получаем "9px"
alert(typeof("$" + 4 + 5)); // слева направо, будет $+4 = "$4" , строка, и плюс 5, будет "$45"
alert(typeof("4" - 2)); // тока плюс умеет со строками, будет число 2
alert(typeof("4px" - 2)); // тока плюс умеет со строками, будет NaN (px не удастся распарсить) - 2, будет NaN, число
alert(typeof("  -9  " + 5)); // тут плюс, работаем слева направо со строкой, будет строка "  -9  5"
alert(typeof("  -9  " - 5)); //тут минус, не работает со строками, будет -9-5 = -14, число
alert(typeof(null + 1)); // тут null в 0 преобразуем, будет 0+1 = 1, число
alert(typeof(undefined + 1)); // тут будет преобразование undefined в NaN, и потом +1, будет NaN, число
alert(typeof(" \t \n" - 2)); // минус не умеет со строкой, будет пустая строка (тк табуляция и пробелы убираются), значит преобразование в 0 и 0-2 = -2, число

//все верно по типам, все ок))) машина