/*
Каким будет результат этих выражений?

5 > 4
"ананас" > "яблоко"
"2" > "12"
undefined == null
undefined === null
null == "\n0\n"
null === +"\n0\n"

 */

alert(5 > 4); //true, 5 больше 4
alert("ананас" > "яблоко"); //false, на первой букве посыпемся, я больше а
alert("2" > "12"); // true, два больше одного, сравниваем тут строки
alert(undefined == null); // true, при нестрогом undefined == только null
alert(undefined === null); // false, при строгом разные типы (undefined и object от null)
alert(null == "\n0\n"); // null равен только undefined!!!!!!!
alert(null === +"\n0\n"); // тут не будет приведения типа, тк стоит строгое равенство, будет false, тк типы разные (object и номер, потому что перед строкой стоит +, это как функция Number) надо покумекать насчет + перед строкой